Source.txt

<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>b7a258211eb14e918f4fc0fbd3f27127</tem:apiSessionId>
    <tem:qflowCustomerId>22377753</tem:qflowCustomerId>
    <tem:remoteId>1068825478</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>-- 
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>841514f6e70a4fc5aff59d1a00de2051</tem:apiSessionId>
    <tem:qflowCustomerId>22377754</tem:qflowCustomerId>
    <tem:remoteId>1068825494</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>53c0b951d9fd4e4d8c3f24433bb384d7</tem:apiSessionId>
    <tem:qflowCustomerId>22377755</tem:qflowCustomerId>
    <tem:remoteId>1068825510</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>a7012c6eb2c8470c8dbe58e10d408d1a</tem:apiSessionId>
    <tem:qflowCustomerId>22377756</tem:qflowCustomerId>
    <tem:remoteId>1068825536</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--  
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>c4578b015e384ababcab8e62a493e9dc</tem:apiSessionId>
    <tem:qflowCustomerId>22377757</tem:qflowCustomerId>
    <tem:remoteId>1068825569</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>afab9865f47a453fa010f7b93c26be36</tem:apiSessionId>
    <tem:qflowCustomerId>22377758</tem:qflowCustomerId>
    <tem:remoteId>1068825601</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>d97017d109ba4b41818054a7a4154dd5</tem:apiSessionId>
    <tem:qflowCustomerId>22377759</tem:qflowCustomerId>
    <tem:remoteId>1068825643</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>3e91e1ec9db841e6a3d866c7e8413a61</tem:apiSessionId>
    <tem:qflowCustomerId>22377760</tem:qflowCustomerId>
    <tem:remoteId>1068825668</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>3274f4e29d5e41c285706bf2eebf8314</tem:apiSessionId>
    <tem:qflowCustomerId>22377761</tem:qflowCustomerId>
    <tem:remoteId>1068825684</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>3057142025f34a8ca13b87233c4df275</tem:apiSessionId>
    <tem:qflowCustomerId>22377762</tem:qflowCustomerId>
    <tem:remoteId>1068825833</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>8495553bdf2a4d6a9a62a5e5c81f33f4</tem:apiSessionId>
    <tem:qflowCustomerId>22377763</tem:qflowCustomerId>
    <tem:remoteId>1068825908</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>0d305ae35c1345f2aeb818bdd050186d</tem:apiSessionId>
    <tem:qflowCustomerId>22377764</tem:qflowCustomerId>
    <tem:remoteId>1068825932</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>5a33a8c5b11047578083b0ea6180eb70</tem:apiSessionId>
    <tem:qflowCustomerId>22377765</tem:qflowCustomerId>
    <tem:remoteId>1068825965</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>6fbd41179a964392abaa877d2572d26b</tem:apiSessionId>
    <tem:qflowCustomerId>22377767</tem:qflowCustomerId>
    <tem:remoteId>1068825973</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--
<soap:Envelope xmlns:tem="http://tempuri.org/" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsrm="http://docs.oasis-open.org/ws-rx/wsrm/200702"><wsa:Action>http://tempuri.org/IOpsamAPIService/UpdateIdMatchingStatus</wsa:Action><wsa:To>https://preprod.appointments.common.int.boots.co.uk/QFlow_63_API/Services/OpsamAPIService.svc</wsa:To></soap:Header><soap:Body><tem:UpdateIdMatchingStatus xmlns:tem="http://tempuri.org/">
    <tem:apiSessionId>68171181f35a43f0acd6a4221f00c024</tem:apiSessionId>
    <tem:qflowCustomerId>22377766</tem:qflowCustomerId>
    <tem:remoteId>1068825981</tem:remoteId>
    <tem:remoteType>OPS</tem:remoteType>
    <tem:matchStatus>Confirmed</tem:matchStatus>
</tem:UpdateIdMatchingStatus></soap:Body></soap:Envelope>--


